study/devops/docker/docker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Docker</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Docker</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org488160c">Resources</a>
<ul>
<li><a href="#org3f124a9">Docker Tutorial for Beginners - Ben Awad</a></li>
</ul>
</li>
<li><a href="#org45b95ca">Usage</a></li>
<li><a href="#org93a1ad3">Commands</a>
<ul>
<li><a href="#orgf3ea40e">port</a></li>
<li><a href="#org9c6ca3a">build</a></li>
<li><a href="#orgc8e1d26">exec</a></li>
<li><a href="#org04d4727">images</a></li>
<li><a href="#org684fb19">ps</a></li>
<li><a href="#org826de59">rm</a></li>
<li><a href="#orgd3acfb1">rmi</a></li>
<li><a href="#org67a3f76">run</a></li>
<li><a href="#org2c984ff">stop</a></li>
<li><a href="#org0de4e85">logs</a></li>
<li><a href="#orgcf3f310">volume</a></li>
</ul>
</li>
<li><a href="#org00fddee">Tips</a>
<ul>
<li><a href="#org3850d87">Stopping the Docker daemon</a></li>
<li><a href="#org8996a94">iptables rules on Docker</a></li>
<li><a href="#org07477cf">Nix</a></li>
</ul>
</li>
<li><a href="#orgf604ae5">Docker Compose</a></li>
<li><a href="#orgc094657">Podman</a></li>
</ul>
</div>
</div>
<p>
Written in Go.
</p>

<div id="outline-container-org488160c" class="outline-2">
<h2 id="org488160c">Resources</h2>
<div class="outline-text-2" id="text-org488160c">
<p>
<a href="https://nixos.wiki/wiki/Docker">https://nixos.wiki/wiki/Docker</a>
</p>

<p>
<b>Book</b>
&gt; Docker: Up &amp; Running
</p>
</div>

<div id="outline-container-org3f124a9" class="outline-3">
<h3 id="org3f124a9">Docker Tutorial for Beginners - Ben Awad</h3>
<div class="outline-text-3" id="text-org3f124a9">
<p>
&gt; <a href="https://youtu.be/0N3n56KsC28">Docker Tutorial for Beginners - Ben Awad</a> (youtube video)
</p>

<p>
Create a file called <code>dockerfile</code>
We are going to build a image, this will be called a <b>container</b>
</p>

<ul class="org-ul">
<li><a href="https://hub.docker.com">dockerhub</a></li>
</ul>

<p>
FROM &lt;name of image&gt;:&lt;version&gt; (check on dockerhub)
COPY &lt;source of files&gt; &lt;where to store the container&gt;
RUN &lt;command that installs dependencies, ex: npm install&gt;
</p>

<p>
<b>DOCKERFILE</b>
</p>
<div class="org-src-container">
<pre class="src src-dockerfile">FROM node:latest

COPY . .

RUN npm install

CMD node src/index.js
</pre>
</div>

<p>
Creating the container.
<code>$ docker build -t &lt;name&gt;/&lt;container-name&gt;:&lt;version&gt;</code>
<span class="underline">example</span>: <code>$ docker build -t benawad/node-example:1 .</code>
</p>

<p>
<span class="underline">note</span>: Whenever chaning the code you will have to rebuild the image, rebuild it with same command as before, but specify a new version
<span class="underline">example</span>: <code>$ docker build -t benawad/node-example:2 .</code>
</p>

<p>
Running the image
<code>$ docker run -p &lt;port to open&gt;:&lt;port specified on app&gt; &lt;name&gt;/&lt;container -name&gt;:&lt;version&gt;</code>
<span class="underline">example</span>: <code>$ docker run -p 8001:3001 benawad/node-example:1</code>
<span class="underline">note</span>: It will lock your terminal, specify <code>-d</code> flag to detach into background.
</p>

<p>
See all the running containers and their ID's
<code>$ docker container ls</code>
</p>

<p>
Stop a container
<code>$ docker container stop &lt;container-id&gt;</code>
</p>

<p>
To check logs, add a console output to your code, and do the next
<code>$ docker container logs &lt;container-id&gt;</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org45b95ca" class="outline-2">
<h2 id="org45b95ca">Usage</h2>
<div class="outline-text-2" id="text-org45b95ca">
<p>
&gt; <a href="https://hub.docker.com">dockerhub</a>
</p>

<p>
When it's running -&gt; <b>container</b>
When it's being built / before running -&gt; <b>image</b>
</p>

<p>
Build this image.
<code># docker build . -t my_first_image</code>
</p>

<p>
Check the images on your system.
<code># docker images</code>
</p>

<p>
Get the image for debian latest.
<code># docker pull debian:latest</code>
</p>

<p>
<code># docker run -dit --name myContainer &lt;image name&gt;</code>
</p>

<p>
<code>-d</code> -&gt; Run on background independently.
<code>-i</code> -&gt; Interactive.
<code>-t</code> -&gt; Terminal.
</p>

<p>
<code>--name</code> -&gt; my Container
<code>&lt;image name&gt;</code>
</p>

<p>
See running containers.
<code># docker ps</code>
</p>

<p>
Connect to container.
<code># docker exec -it myContainer bash</code>
</p>

<p>
You will change now to the terminal in the container.
-&gt; <code>root@&lt;container id&gt;</code>
</p>

<p>
&#x2014;
Ubuntu
</p>

<p>
Installing packages on this container.
<code>:/# apt update</code>
<code>:/# apt install iputils-ping</code>
<code>:/# ping &lt;host ip&gt;</code>
</p>
</div>
</div>

<div id="outline-container-org93a1ad3" class="outline-2">
<h2 id="org93a1ad3">Commands</h2>
<div class="outline-text-2" id="text-org93a1ad3">
</div>
<div id="outline-container-orgf3ea40e" class="outline-3">
<h3 id="orgf3ea40e">port</h3>
</div>
<div id="outline-container-org9c6ca3a" class="outline-3">
<h3 id="org9c6ca3a">build</h3>
<div class="outline-text-3" id="text-org9c6ca3a">
<p>
Build an image from a Dockerfile.
<code># docker build -t . &lt;name&gt;:&lt;tag&gt; &lt;dir/of/dockerfile&gt;</code>
<span class="underline">example</span>: <code># docker build -t my_first_image:v2 .</code>
</p>
</div>
</div>

<div id="outline-container-orgc8e1d26" class="outline-3">
<h3 id="orgc8e1d26">exec</h3>
<div class="outline-text-3" id="text-orgc8e1d26">
<p>
Execute a command in a running container.
<code># docker exec &lt;container name/ID&gt;</code>
<span class="underline">example</span>: <code># docker exec -it myContainer bash</code>
</p>

<p>
Flags
<code>-i</code> / <code>--interactive</code> -&gt; Keep STDIN open.
<code>-t</code> / <code>--tty</code> -&gt; Allocate a pseudo-TTY.
</p>
</div>
</div>

<div id="outline-container-org04d4727" class="outline-3">
<h3 id="org04d4727">images</h3>
<div class="outline-text-3" id="text-org04d4727">
<p>
List the images built from Dockerfiles.
</p>
</div>
</div>

<div id="outline-container-org684fb19" class="outline-3">
<h3 id="org684fb19">ps</h3>
<div class="outline-text-3" id="text-org684fb19">
<p>
Show currently running containers.
<code># docker ps</code>
</p>

<p>
<code>-a</code> / <code>--all</code> -&gt; List all containers on the host.
<code>-q</code> / <code>--quiet</code> -&gt; Only show container ID's.
</p>
</div>
</div>

<div id="outline-container-org826de59" class="outline-3">
<h3 id="org826de59">rm</h3>
<div class="outline-text-3" id="text-org826de59">
<p>
Remove a container.
<code># docker rm &lt;container/name/or/id&gt;</code>
<span class="underline">note</span>: It won't work for running containers, you will have to stop them. Or run the <code>--force</code> flag.
</p>

<p>
Remove containers even running ones.
<code># docker rm &lt;container/name/or/id&gt; --force</code>
</p>

<p>
Remove all containers.
<code># docker rm $(docker ps -a -q)</code>
<span class="underline">note</span>: If root is needed then <code>$ sudo docker rm $(sudo docker ps -a -q)</code>
</p>
</div>
</div>

<div id="outline-container-orgd3acfb1" class="outline-3">
<h3 id="orgd3acfb1">rmi</h3>
<div class="outline-text-3" id="text-orgd3acfb1">
<p>
Check the images on the system.
<code># docker images</code>
</p>

<p>
Delete an image.
<code># docker rmi &lt;image name&gt;</code>
</p>

<p>
Delete all images.
<code># docker rmi $(docker images -q)</code>
<span class="underline">note</span>: If root is needed then <code>$ sudo docker rmi $(sudo docker images -q)</code>
</p>
</div>
</div>

<div id="outline-container-org67a3f76" class="outline-3">
<h3 id="org67a3f76">run</h3>
<div class="outline-text-3" id="text-org67a3f76">
<p>
Create and run a container from an image.
<code># docker run [options] &lt;name of image&gt;</code>
<span class="underline">example</span>: <code># docker run -dit myContainer myimage</code>
</p>

<p>
Create and run a container with a folder mounted to the <b>/var/www/html</b> folder and attached to port 80.
<code># docker run -dit -p 80:80 -v /home/user/webfiles:/var/www/html --name myWebServer webserver</code>
<span class="underline">note</span>: Adding a <code>:ro</code> at the end of the mount will make the files be read-only.
</p>

<p>
Flags
<code>-d</code> / <code>--detach</code> -&gt; Run container in background.
<code>-i</code> / <code>--interactive</code> -&gt; Keep STDIN open.
<code>-t</code> / <code>--tty</code> -&gt; Allocate a pseudo-TTY.
<code>-p</code> / <code>--publish</code> <code>&lt;number&gt;</code> -&gt; Publish a container port to the host.
<code>-v</code> / <code>--volume &lt;path&gt;</code> -&gt; Mount a volume or folder to the container.
<code>--name &lt;string&gt;</code> -&gt; Give a name to the container.
</p>
</div>
</div>

<div id="outline-container-org2c984ff" class="outline-3">
<h3 id="org2c984ff">stop</h3>
<div class="outline-text-3" id="text-org2c984ff">
<p>
Stops a running container.
<code># docker stop &lt;container/name/or/id&gt;</code>
</p>
</div>
</div>

<div id="outline-container-org0de4e85" class="outline-3">
<h3 id="org0de4e85">logs</h3>
<div class="outline-text-3" id="text-org0de4e85">
<p>
Get logs of a specific container.
<code># docker logs &lt;container/name/or/id&gt;</code>
</p>
</div>
</div>

<div id="outline-container-orgcf3f310" class="outline-3">
<h3 id="orgcf3f310">volume</h3>
<div class="outline-text-3" id="text-orgcf3f310">
<p>
<code># docker volume ls -q</code>
<code># docker volume rm $(docker volume ls -q)</code>
-&gt; <code>$ sudo docker volume rm $(sudo docker volume ls -q)</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org00fddee" class="outline-2">
<h2 id="org00fddee">Tips</h2>
<div class="outline-text-2" id="text-org00fddee">
</div>
<div id="outline-container-org3850d87" class="outline-3">
<h3 id="org3850d87">Stopping the Docker daemon</h3>
<div class="outline-text-3" id="text-org3850d87">
<p>
&gt; <a href="https://stackoverflow.com/questions/42365336/how-to-stop-docker-under-linux">How to stop docker under Linux - StackOverflow</a>
</p>

<p>
Stop the docker container with.
<code># systemctl stop docker</code>
</p>

<p>
Stop the socket too if required.
<code># systemctl stop docker.socket</code>
</p>
</div>
</div>

<div id="outline-container-org8996a94" class="outline-3">
<h3 id="org8996a94">iptables rules on Docker</h3>
<div class="outline-text-3" id="text-org8996a94">
<p>
iptables on Docker
</p>

<p>
<code># docker run -dit -p 80:80 --cap-add=NET_ADMIN --name myContainer my_image</code>
<code># docker exec -it myContainer bash</code>
<code># apt install iptables -y</code>
</p>
</div>
</div>

<div id="outline-container-org07477cf" class="outline-3">
<h3 id="org07477cf">Nix</h3>
<div class="outline-text-3" id="text-org07477cf">
<p>
&gt; <a href="https://thewagner.net/blog/2021/02/25/building-container-images-with-nix/">Building container images with Nix</a>
</p>

<p>
&#x2026;
</p>
</div>
</div>
</div>

<div id="outline-container-orgf604ae5" class="outline-2">
<h2 id="orgf604ae5">Docker Compose</h2>
<div class="outline-text-2" id="text-orgf604ae5">
<p>
Will read the <code>docker-compose.yml</code> inside the folder.
</p>

<p>
Build the images and run the container(s).
<code># docker compose up -d</code>
</p>

<p>
Tear down the compose.
<code># docker compose down</code>
</p>
</div>
</div>

<div id="outline-container-orgc094657" class="outline-2">
<h2 id="orgc094657">Podman</h2>
<div class="outline-text-2" id="text-orgc094657">
<ul class="org-ul">
<li><a href="https://podman.io/">main page</a></li>
</ul>

<p>
While most of the commands can be run as user, there will be sometimes where you will need to execute as <b>root</b>.
</p>

<p>
<span class="underline">example</span>: Run the <code>nginx</code> container and expose port 80
<code>$ podman run -p 80:80 -d nginx</code>
This will fail as all ports below &lt;=1024 are privileged ports, so we need to be root user to expose them.
</p>

<p>
Let's change the port to another one
<code>$ podman run -p 8080:80 -d nginx</code>
</p>

<p>
Check with
<code>$ podman ps</code>
</p>

<p>
And also
<code>$ ps aux | grep nginx</code>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
